# macos-setup Brewfile
# 工具链清单：AI Agent 友好 = 工具链完备
# 使用方式：brew bundle install --file=Brewfile

# ─────────────────────────────────────────
# Core CLI Tools (AI Agent 必需)
# ─────────────────────────────────────────
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "gh"

# ─────────────────────────────────────────
# Shells & Environment
# ─────────────────────────────────────────
brew "zsh"
brew "starship"

# ─────────────────────────────────────────
# Runtime Version Managers
# ─────────────────────────────────────────
brew "mise"

# ─────────────────────────────────────────
# macOS-specific Tools
# ─────────────────────────────────────────
# 窗口管理
cask "rectangle"

# ─────────────────────────────────────────
# Development Tools
# ─────────────────────────────────────────
# 基础开发工具（通过 mise 管理版本，此处仅安装 mise 本身）
# Node/Python/Go 由 mise 在 setup.sh 中安装

# ─────────────────────────────────────────
# Utilities
# ─────────────────────────────────────────
brew "tree"
brew "ncdu"
brew "htop"
brew "mas"  # macOS App Store CLI
